Examinator/src/Catalogs/ЗаданияСУО/ЗаданияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЗаданияСУО</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.КаталогМероприятийСУО</owners>
  <owners>Catalog.Пользователи</owners>
  <owners>Catalog.СхемыМероприятийСУО</owners>
  <attributes>
    <name>НаОсновеЭлектронногоРесурса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныйРесурс</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Фрагмент</name>
    <type>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначимостьОценки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Продолжительность</name>
    <comment>(используется для подборок в режиме тестирования)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьВСекундах</name>
    <comment>(используется для подборок в режиме тестирования)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>32</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопыток</name>
    <comment>(используется для подборок в режиме тестирования)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСтраницВопросов</name>
    <comment>(используется для подборок в режиме тестирования)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьНавигацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереходитьВпередАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеремешиватьСтраницыВопросов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСтандартныеНастройкиТеста</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеФорматированныйДокумент</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяФорматированныйДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопытокВыполненияЗадания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НесколькоВариантов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобавитьВБиблиотеку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МеткаВБиблиотеке</name>
    <type>
      <types>CatalogRef.СтруктураБиблиотекиПользователейСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДополнительныеМатериалы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МетодВыбораПопыткиПрохождения</name>
    <type>
      <types>EnumRef.МетодВыбораПопыткиПрохожденияСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПреподавательВыставляетОценку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьПрикреплениеФайлаКОтвету</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НеЖдатьПроверки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/Catalogs/ЗаданияСУО/Forms/ЗаданиеНаПроверку/Module.bsl
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьПараметрСпискаФайлов();
	УстановитьДоступностьЭлементовФормы();
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		ОписаниеФорматированныйДокумент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.ЗначениеКопирования, "ОписаниеФорматированныйДокумент").Получить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ОписаниеФорматированныйДокумент = ТекущийОбъект.ОписаниеФорматированныйДокумент.Получить();
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)	
	ВыполнитьПроверкуПередЗаписью(Отказ, Ложь);	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПроверкуПередЗаписью(Отказ, ЗакрытьФорму)
	
	Если ВыполняетсяЗапись Тогда
		Возврат;
	КонецЕсли;
	
	ФормаПроведенияВладелец = ОбщегоНазначенияСУКлиент.НайтиВладельцаУправляемойФормы(ЭтотОбъект.ВладелецФормы, "Документ.ПроведениеОбученияСУО.Форма.ФормаДокумента");
	
	Если ФормаПроведенияВладелец <> Неопределено И НЕ ВыполняетсяЗапись Тогда
		Если ФормаПроведенияВладелец.ЭтоКопирование Тогда
			Отказ = Истина;
			ПараметрыВопросаПродолжение = Новый Структура;
			ПараметрыВопросаПродолжение.Вставить("ЗакрытьФорму", ЗакрытьФорму);
			Оповещение = Новый ОписаниеОповещения("ВыполнитьПроверкуПередЗаписьюПродолжение", ЭтотОбъект, ПараметрыВопросаПродолжение);
			ПоказатьВопрос(Оповещение, НСтр("ru = 'Изменение задания в скопированном проведении обучении
                                             |приведет к его изменению и в оригинальном проведении обучения. Продолжить?'"), РежимДиалогаВопрос.ДаНет, 0);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ВыполнитьПроверкуПередЗаписьюПродолжение(Результат, ПараметрыВопросаПродолжение) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		ВыполняетсяЗапись = Ложь;
		ВыполняетсяЗакрытие = Ложь;
	    Возврат;
	КонецЕсли;

	ВыполняетсяЗапись = Истина;
	Если ПараметрыВопросаПродолжение.ЗакрытьФорму Тогда
		ВыполняетсяЗакрытие = Истина;
	КонецЕсли;

	Записать();
	Если ПараметрыВопросаПродолжение.ЗакрытьФорму Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ВыполняетсяЗапись = Ложь;
	ВыполняетсяЗакрытие = Ложь;
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("КонтекстРедактирования", Параметры.КонтекстРедактирования);
	ТекущийОбъект.ОписаниеФорматированныйДокумент = Новый ХранилищеЗначения(ОписаниеФорматированныйДокумент);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УстановитьПараметрСпискаФайлов();
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ЗаданиеНаПроверкуЗаписано");
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	ВыполняетсяЗапись = Ложь;
	ВыполняетсяЗакрытие = Ложь;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ЗаписатьИЗакрытьКоманда(Команда)
	Отказ = Ложь;
	ВыполнитьПроверкуПередЗаписью(Отказ, Истина);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	Если Записать() Тогда
		Закрыть();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыФайлы

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Файлы

&НаКлиенте
Процедура ФайлыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	ДобавитьФайлВСписок();
КонецПроцедуры

&НаКлиенте
Процедура ФайлыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ТипЗнч(ВыбраннаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		Возврат;
	КонецЕсли;
	ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаДляОткрытия(ВыбраннаяСтрока,, УникальныйИдентификатор);
	РаботаСФайламиСлужебныйКлиент.ОткрытьФайлСОповещением(Неопределено, ДанныеФайла, УникальныйИдентификатор);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура ДобавитьФайлВСписок()
	
	Отказ = Ложь;
	ОбщегоНазначенияСУКлиент.ПередДобавлениемЭлементаПодчиненногоСправочника(ЭтотОбъект, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеСозданияФайла", ЭтотОбъект);
	
	ПараметрыВыполнения = Новый Структура;
	ПараметрыВыполнения.Вставить("ОбработчикРезультата",                    ОписаниеОповещения);
	ПараметрыВыполнения.Вставить("ВладелецФайла",                           Объект.Ссылка);
	ПараметрыВыполнения.Вставить("ФормаВладелец",                           ЭтотОбъект);
	ПараметрыВыполнения.Вставить("ЭтоФайл",                                 Истина);
	ПараметрыВыполнения.Вставить("НеОткрыватьКарточкуПослеСозданияИзФайла", Истина);
	
	РаботаСФайламиСлужебныйКлиент.ДобавитьПослеВыбораРежимаСоздания(2, ПараметрыВыполнения);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеСозданияФайла(Результат, ДополнительныеПараметры) Экспорт
	Элементы.Файлы.Обновить();
КонецПроцедуры
	
&НаСервере
Процедура УстановитьПараметрСпискаФайлов()
	Если Объект.Ссылка.Пустая() Тогда
		Файлы.Параметры.УстановитьЗначениеПараметра("Владелец", Неопределено);
	Иначе
		Файлы.Параметры.УстановитьЗначениеПараметра("Владелец", Объект.Ссылка);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	Элементы.ФайлыСоздать.Доступность = ПравоДоступа("Добавление", Метаданные.Справочники.ЗаданияСУО);
	Элементы.ГруппаФорматированныйДокумент.Видимость = Объект.ИспользуетсяФорматированныйДокумент;
	Элементы.Описание.Видимость = НЕ Объект.ИспользуетсяФорматированныйДокумент;
КонецПроцедуры




#КонецОбласти
